{"data":{"markdownRemark":{"html":"<p><img src=\"https://images.unsplash.com/photo-1514862474054-e3509f8af30f?ixlib=rb-1.2.1&#x26;ixid=eyJhcHBfaWQiOjEyMDd9&#x26;auto=format&#x26;fit=crop&#x26;w=2250&#x26;q=80\" alt=\"Phone and fireworks\">\nIt's almost 2019 and there are some amazing things coming down the pipeline in the world of programming. But for many new developers the prospect of jumping into a career in coding can be intimidating.</p>\n<p>There are so many technologies to learn and so many languages to choose from. Thus, I've compiled (no pun intended) a list of 19 tips for software engineers in 2019.</p>\n<p>Happy coding 🤩💻</p>\n<h1>1. Don't get discouraged</h1>\n<p>The technology industry is one of the most intense and volatile industries out there, and it can be overwhelming to jump into. What I try to remember each day is that everyone, at some point in their coding career, started where I did. All of the industry leaders in tech were once beginners.</p>\n<p>Do some people learn faster than others? Yes. But you can't let that discourage you from getting started.</p>\n<p>Coding careers are desirable for a very good reason: you can teach yourself anything on the internet... for free! And often the lifestyle which accompanies a career in tech is much more comfortable than other careers.</p>\n<p>It's important to keep in mind that, while there are a plethora of resources out there, you don't need to learn everything. Start with the basics.</p>\n<p>The first step is to decide whether you'd prefer to begin your career in front-end (the user interface of the application you interact with) or back-end (working with data). Once you choose your niche, start with the basics.</p>\n<p>If you've selected front-end development, hone in on HTML, CSS, and JavaScript. Don't take these skills for granted. While they may seem simple at first glance, a strong knowledge of the foundations of web development will land you your first role as a Software Engineer. Most companies would prefer to see a candidate with strong \"vanilla\" skills than a pretty good understanding of a popular framework/library.</p>\n<p>If you decide to go the back-end development route, try out a language like Python or Java. These are highly coveted skills in the tech industry.</p>\n<p>But do not get discouraged. You will have days where you feel utterly overwhelmed. Everyone began their journey where you did. It will get easier.</p>\n<h1>2. Learn to read &#x26; decipher code</h1>\n<p>One of the skills that I took for granted when I began my coding journey was the ability to read other developer's code. This is a truly important skill because it allows you to work effectively in many different code bases.</p>\n<p>You don't need to know all of the nuances of a programming language in order to decipher what that code is doing.</p>\n<p>There are many ways to learn how to read code. Check out some open-source projects. Read through the documentation and the source code and see if you can delineate what's happening. You'll slowly start to realize that there are improvements that can be made, and perhaps you'll even open a PR!</p>\n<p>Learn to analyze the code and determine whether or not it was written in the most effective way.</p>\n<p>Learning to read and review code is a skill that takes time, but is well worth the effort.</p>\n<h1>3. Find your method of learning</h1>\n<p>Humans learn in different ways. Some retain information best when they're writing code. Others learn best by reading or watching videos.</p>\n<p>I prefer to watch online tutorials and read documentation in order to fill in the gaps.</p>\n<p>I'm not the kind of person who can just start a sandbox application and code away. I like to follow a guided tutorial and then expand upon the ideas.</p>\n<p>Find your method of learning. Try out different resources and platforms.</p>\n<p>Once you find your learning method, you'll find that you learn much more efficiently.</p>\n<h1>4. Get involved in the community</h1>\n<p>I didn't join the online tech community until about 3 years into my coding journey. This put me at a huge disadvantage.</p>\n<p>I struggled greatly with impostor syndrome and found it hard to stay motivated. But once I found a community of developers on Twitter and blogging platforms, I became much more invested in learning.</p>\n<p>Find an open source project. Tweet your coding projects. Push your projects to GitHub. Find a way to get involved, and you'll quickly develop a more intimate relationship with coding.</p>\n<h1>5. Balance theory with practicality</h1>\n<p>In order to become an effective programmer, you must understand the theory behind certain paradigms (to a certain extent).</p>\n<p>For example, if you want to understand why a nested for-loop is not as performant as two for-loops within the same scope, you need to understand Big-O notation.</p>\n<p>We live in an age where you don't need a Computer Science degree to succeed in the tech industry. That being said, some of the concepts taught within a CS degree are extremely valuable (i.e. algorithms, run-time analysis, etc.).</p>\n<p>You don't need to learn all of the computer science theory, but you should understand the theory of why one solution is better than another.</p>\n<h1>6. Don't compare yourself to others</h1>\n<p>Your career will never follow the exact same path as another developer. You should not compare yourself to others.</p>\n<p>You are unique and the skills you offer will be tailored to you.</p>\n<p>Just because one of the industry leaders is learning Ruby on Rails doesn't mean you have to follow suit. Find the skills that get you excited about programming, and learn them to the best of your abilities.</p>\n<p>There is no expected time-frame in regards to learning a technology. As I mentioned in tip 3, people learn by different methods, and as such people learn at different rates.</p>\n<p>Just because it takes you three months to learn JavaScript doesn't mean you're a worse developer than the girl who learned it in one.</p>\n<h1>7. Get involved in open source</h1>\n<p>The open-source community is thriving, so why not get involved? If you need a way to boost your code-reading skills, find an open-source project!</p>\n<p>You can check out the <a href=\"https://github.com/open-source\">GitHub Open Source</a> community to get started!</p>\n<p>You can even start your own open source project! I founded my own open-source project, <a href=\"https://github.com/Coding-Coach/coding-coach\">Coding Coach</a>, this last September, and it's been an eye-opening experience.</p>\n<p>If you'd like to get involved and learn from some great developers, feel free to check it out!</p>\n<h1>8. Be comfortable with being uncomfortable</h1>\n<p>The tech industry is constantly changing, which means there is always a new skill to be learned.</p>\n<p>While this can be intimidating at first glance, it also provides many opportunities to find a new technology to learn (how could you ever get bored?!).</p>\n<p>The best way to grow in your coding skills is to tackle tasks that scare you. You can do this at work by volunteering to complete a challenging task. But you can also do this in your spare time with new technologies.</p>\n<p>You have to become comfortable with being uncomfortable. You're not expected to have all of the answers.</p>\n<h1>9. Don't be afraid to ask questions</h1>\n<p>Eventually you will hit a problem that you don't know how to solve. Stack Overflow just isn't cutting it!</p>\n<p>It's important to recognize when you need to ask for help. If you have tried to solve a problem, and gone down all viable paths, it's time to reach out for help.</p>\n<p>Asking for help does not make you look weak; this is something that I still struggle with.</p>\n<p>If you're spending hours trying to figure out why your variable is throwing a ReferenceError, ask for help.</p>\n<h1>10. Surround yourself with people who build you up</h1>\n<p>Coding is hard. You will have days where you don't feel cut out to be a Software Engineer.</p>\n<p>Thus, you must surround yourself with people who believe in you. Find a core group of family or friends who build up your self-esteem, and say goodbye to those who don't.</p>\n<h1>11. Focus on one thing at a time</h1>\n<p>Multitasking is the quickest way to ensure mediocrity. Humans cannot effectively multitask.</p>\n<p>Choose one thing to focus on at a time. Learn it, or complete it, to the best of your abilities. Once complete, move on to the next thing.</p>\n<p>Do not try to juggle several topics at once.</p>\n<h1>12. See the bigger picture - how do all these technologies fit together</h1>\n<p>You will be learning many different technologies throughout your coding career. And it can be extremely confusing to determine which technologies solve what task.</p>\n<p>I like to draw diagrams of complex problems. If I'm tasked with building an application, I like to break it down into domains. For example, I know I need HTML, CSS, and JavaScript on the front-end. Perhaps I'll decide to use React as a JS library. And maybe, if I need this application to scale, I'll choose Redux for state management.</p>\n<p>Learn the best use-cases for different technologies. When would you choose one over another? How do they fit together?</p>\n<p>These are important questions you should learn to answer.</p>\n<h1>13. Find your toolbox - which tools are the best for the job?</h1>\n<p>There are no shortage of tools available to developers these days. I can name at least five IDEs off the top of my head that I've worked with in the past.</p>\n<p>The amount of tools available can be extremely overwhelming. Do some research. Determine which tool is right for you. Some questions you might want to ask are:</p>\n<ul>\n<li>Is this tool being actively maintained?</li>\n<li>Is there a thriving community of developers using it (in the event that you need help)?</li>\n<li>How hard is it to configure?</li>\n<li>Could integrating this tool have negative implications on performance?</li>\n<li>Can I solve the task without the tool?</li>\n</ul>\n<p>Just because a tool exists doesn't mean you need to use it.</p>\n<h1>14. Maintain a good work/life balance</h1>\n<p>You do not need to spend all hours of the day coding. In fact, to do so would be unhealthy.</p>\n<p>You must maintain a healthy work/life balance, or you could suffer the consequences of burnout.</p>\n<p>If you do something from the moment you wake up until the moment you go to sleep at night, you will quickly come to resent it.</p>\n<p>By taking time for yourself, and your other hobbies, you'll maintain a healthy relationship with coding.</p>\n<h1>15. Learn the basics of design</h1>\n<p>If you're building an application that's user-facing, you should know the basics of design. I'm not saying you need to learn how to use Sketch or Adobe Illustrator, but learning the basics of UX Design will positively impact your applications.</p>\n<p>You cannot assume a user will use your application in the same way that you would. In fact, you shouldn't make any assumptions about user behavior at all.</p>\n<p>Understand the reasoning behind certain UI principles in order to determine the best solution for your application.</p>\n<p>For example, it was found that buttons with square edges are actually better for users than buttons with rounded edges, as they contain more pixels.</p>\n<p>Learn these basics, and you can be sure that your web app will shine.</p>\n<h1>16. Find a mentor</h1>\n<p>Finding a mentor is hard, but it's necessary. You can learn invaluable skills from career advice to coding best practices.</p>\n<p>It never hurts to ask someone in the field, whom you admire, to mentor you. The worst thing they can say is no!</p>\n<p>And remember to re-evaluate your mentorship as time progresses, to ensure that it's beneficial to both of you.</p>\n<h1>17. Build a kick-ass portfolio &#x26; resume</h1>\n<p>Portfolios and resumes are your first impression to an employer during an interview process. It's imperative to put on your best face.</p>\n<p>Fix spelling and grammatical errors. Ensure that everything is formatted consistently and appropriately.</p>\n<p>If you want more details on writing an awesome resume, feel free to check out my previous <a href=\"https://levelup.gitconnected.com/how-to-write-a-stand-out-technical-resume-6cce4721cd8c\">blog post</a>.</p>\n<h1>18. Fail fast and fail often</h1>\n<p>Failure is subjective. If you make a mistake, learn from it. Don't make the same mistake twice. Just because something \"failed\" doesn't mean it wasn't valuable.</p>\n<p>The most successful people in history produced vast amounts of work, yet they're only recognized for a few.</p>\n<p>You don't have to code beautiful websites from start to finish for each project you develop. Focus on the underlying technology, and you can worry about making it look nice later.</p>\n<h1>19. Just keep going</h1>\n<p>There will be days you want to give up coding. Don't. It's a difficult career, and everyone suffers with impostor syndrome.</p>\n<p>You are not alone. Coding will get easier over time.</p>\n<p>Take it day-by-day, and you'll be alright.</p>\n<p>Just keep going.</p>","tableOfContents":"<ul>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#1-dont-get-discouraged\">1. Don't get discouraged</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#2-learn-to-read--decipher-code\">2. Learn to read &#x26; decipher code</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#3-find-your-method-of-learning\">3. Find your method of learning</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#4-get-involved-in-the-community\">4. Get involved in the community</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#5-balance-theory-with-practicality\">5. Balance theory with practicality</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#6-dont-compare-yourself-to-others\">6. Don't compare yourself to others</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#7-get-involved-in-open-source\">7. Get involved in open source</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#8-be-comfortable-with-being-uncomfortable\">8. Be comfortable with being uncomfortable</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#9-dont-be-afraid-to-ask-questions\">9. Don't be afraid to ask questions</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#10-surround-yourself-with-people-who-build-you-up\">10. Surround yourself with people who build you up</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#11-focus-on-one-thing-at-a-time\">11. Focus on one thing at a time</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#12-see-the-bigger-picture---how-do-all-these-technologies-fit-together\">12. See the bigger picture - how do all these technologies fit together</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#13-find-your-toolbox---which-tools-are-the-best-for-the-job\">13. Find your toolbox - which tools are the best for the job?</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#14-maintain-a-good-worklife-balance\">14. Maintain a good work/life balance</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#15-learn-the-basics-of-design\">15. Learn the basics of design</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#16-find-a-mentor\">16. Find a mentor</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#17-build-a-kick-ass-portfolio--resume\">17. Build a kick-ass portfolio &#x26; resume</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#18-fail-fast-and-fail-often\">18. Fail fast and fail often</a></li>\n<li><a href=\"/nineteen-tips-for-software-engineers-in-2019/#19-just-keep-going\">19. Just keep going</a></li>\n</ul>","frontmatter":{"path":"/nineteen-tips-for-software-engineers-in-2019","title":"19 Tips For Software Engineers In 2019","author":"Emma Wedekind","date":"2018-12-23"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"section":null}}