{"errors":[{"message":"Expected node, got `null`","locations":[{"line":6,"column":5}],"path":["markdownRemark","tableOfContents"]}],"data":{"markdownRemark":{"html":"<p><img src=\"https://cdn-images-1.medium.com/max/2000/1*cyq39_Fi_qPwiAJqgeCsCg.jpeg\" alt=\"Two people at computer\"></p>\n<p>Bias has been prevalent since the dawn of time, and as humans we fall prey to being biased in many facets of our lives (whether we realize it or not). Yet we are currently enduring an era where bias is permeating the tech industry, and something must be done.</p>\n<p><em>“The inclination or prejudice for or against one person or group, especially in a way considered to be unfair.”</em></p>\n<p>The gender gap is one of the most widely-recognized cases of bias in the technical industry, but it’s not the only one.</p>\n<h2>Understanding Bias</h2>\n<p>Unconscious bias is one of the biggest catalysts to a lack of diversity in the technical industry. Although the largest impact can be seen within the hiring process, the effects trickle down throughout promotions and other areas.</p>\n<p>There are nine types of unconscious bias:</p>\n<h3>Affinity Bias</h3>\n<p>An unconscious preference for people who share similar qualities with you or someone you like.</p>\n<h3>Attribution Bias</h3>\n<p>How you perceive your actions and those of others — our personal accomplishments are the result of hard work, but our failures are the result of external factors, whereas a candidate’s accomplishments are the result of luck and their failures result of a lack of ability.</p>\n<h3>Beauty Bias</h3>\n<p>An unconscious preference for people who are physically attractive.</p>\n<h3>Conformity Bias</h3>\n<p>When your views are swayed too much by those of other people.</p>\n<h3>Confirmation Bias</h3>\n<p>An unconscious search for evidence which support your opinions.</p>\n<h3>The Contrast Effect</h3>\n<p>An unconscious comparison of two or more similar candidates as opposed to examining each candidate individually.</p>\n<h3>Gender Bias</h3>\n<p>A preference for one gender over another gender.</p>\n<h3>The Halo Effect</h3>\n<p>Focusing on one particularly positive feature of a candidate.</p>\n<h3>The Horns Effect</h3>\n<p>Focusing on one particularly negative feature of a candidate.</p>\n<p>Unconscious bias directly impacts our ability to hire great candidates, so we must be diligent about recognizing and fighting it every single day.</p>\n<h2>Why This Matters</h2>\n<p>When we don’t address unconscious bias in the technical industry, severe problems begin to arise.</p>\n<h3>Diversity In The Workplace</h3>\n<p>Your company cannot employ a diverse workforce if unconscious bias is not addressed. When companies hire candidates who fit a one-size-fits-all mold, there is a lack of innovation.</p>\n<p><em>“Companies that employ a more diverse workforce tend to have higher levels in innovation.”</em></p>\n<p>Innovation is drastically improved with a diverse workforce, because people from different backgrounds tend to view the world differently; they bring different vantage points to the drawing board.</p>\n<p>Additionally, employees from diverse backgrounds are more likely to empathize with users from all over the world, which can enhance the quality of the relationships you forge with your customers and may allow you to create solutions tailored to all.</p>\n<h3>Algorithms Are Learning Bias</h3>\n<p>One massive impact of unconscious bias in the tech industry is the inability of the algorithms we develop to be unbiased. If our workforce isn’t diverse, the algorithms we build inherently cannot adopt diverse ways of “thinking.”</p>\n<p>Facial recognition algorithms designed by IBM, Microsoft, and Face++ were found to have <a href=\"https://www.theverge.com/2018/7/26/17616290/facial-recognition-ai-bias-benchmark-test\">error rates</a> approximately 35 percent higher when detecting the gender of darker-skinned women as opposed to lighter-skinned men.</p>\n<p>By removing unconscious bias we can employ a more diverse set of employees, which in turn may provide our algorithms with the tools needed to be inclusive of all people.</p>\n<h3>Employee Wellbeing</h3>\n<p>Out of 557 female scientists interviewed by <a href=\"https://hbr.org/2015/03/the-5-biases-pushing-women-out-of-stem?cm_lm=\">Harvard Business Review</a>, two-thirds reported having to prove their skillset time and time again. And unfortunately, this constant need to prove their worth has driven many women out of the career.</p>\n<p>In a survey conducted by <a href=\"https://money.cnn.com/interactive/technology/tech-diversity-data/\">CNN Money</a>, it was found that just 30% of professionals at Dell identify as female and that statistic dropped as low as 25% at Intel.</p>\n<p>Unconscious bias is leading to employees feeling insecure or personally attacked in the workplace. An effective company ensures the well-being of all employees, regardless of demographic or circumstance.</p>\n<h2>Why This Matters</h2>\n<p>There are five ways in which we can combat bias in the tech industry.</p>\n<h3>1. Provide Different Technical Interviewing Styles</h3>\n<p>Many technical interviews are geared towards one type of candidate; those who thrive under pressure to live-code and answer tricky technical questions. Developers who get nervous under pressure tend to fail at these types of interviews, but these can be some of the most brilliant candidates.</p>\n<p>By only leveraging high-stress, “on-the-spot” technical interviews, companies may exclude candidates who would be a true asset to their team.</p>\n<p>Thus, companies should leverage different interview styles, such as take-home challenges or pair programming, for candidates in order to ensure everyone has a fair chance to succeed.</p>\n<p>At LogMeIn I was given a take-home coding challenge. This task was achievable within a few hours, and was open-ended, ultimately allowing me to select my tech stack and architect the application as I saw fit.</p>\n<p>The take-home coding challenge is one great example of a different style of interviewing. It allowed me to showcase my skills in a low-stress situation, and ultimately get the job.</p>\n<p>Other technical interview styles could include pair programming. Through a pair programming activity, team members can see what it would be like to work with a candidate.</p>\n<p>The types of questions candidates are asked during interviews can also make or break their success. During my interview with my current manager, he asked me the following question:</p>\n<p>“What books or resources would you suggest to someone who has no knowledge of front-end development, but wants to learn?”</p>\n<p>This shows insights on a few different levels. It shows that the candidate is capable of educating fellow developers. It shows that the candidate stays up-to-date in the industry. It shows that the candidate has a passion for learning.</p>\n<p>Asking these types of questions give valuable insight into a candidate’s technical ability without putting them on-the-spot with a technical problem.</p>\n<p>The important note is to provide alternatives for candidates to showcase their best work.</p>\n<h3>2. Provide Interest &#x26; Support Groups</h3>\n<p>If you’re going to hire a diverse set of employees, it’s important to ensure they feel included in the company.</p>\n<p>LogMeIn is making great strides towards inclusiveness. LogHerIn is an initiative at LogMeIn which encourages women in technology. It’s a great way for women across the company to make connections and get support. There is even a Slack channel called Ladies Lunch which allow women to find a buddy for lunch, and not eat alone.</p>\n<p>LogMeIn also supports LGBTQ+ PRIDE, which stands for Promoting Respect, Inclusion, Diversity, and Equality.</p>\n<p><em>“We are driven to increase employee community awareness and create an inclusive environment. We want LogMeIn employees to bring their true authentic selves to work regardless of sexual orientation, gender identity, gender expression, or any other characteristic.”</em></p>\n<p>PRIDE offers multiple benefits to employees such as:</p>\n<ul>\n<li>Discussions for LGBTQ+ employees and Allies</li>\n<li>Regular meetings about issues which impact LGBTQ+ employees</li>\n<li>Celebrating PRIDE events around the world</li>\n<li>Panel discussions about various LGBTQ+ topics</li>\n</ul>\n<p>Interest and support groups allow employees of diverse backgrounds and demographics to connect on a personal level, ultimately delivering better work and enhancing employee <a href=\"http://lasd/\">happiness</a>.</p>\n<h3>3. Create A Culture Of Acceptance And Trust</h3>\n<p>My development team at LogMeIn created a social contract in order to establish more meaningful and trustworthy relationships. <a href=\"https://hbr.org/2012/04/to-ensure-great-teamwork-start\">Social contracts</a> are a great way to set the standard for acceptable communication and behavior.</p>\n<p>Additionally, it’s important to re-iterate important points that are said during meetings. If a team member makes a valuable observation, start your next point with “Sarah had a really great point, and to build on that…” This will build up your colleagues and validate their self-assuredness.</p>\n<h3>4. Respect Your Colleagues</h3>\n<p>All employees, regardless of demographic, deserve the same level of respect. This extends to compensation. The amount of money an employee makes should be based on merit, not on demographic; two employees in the same role, performing at the same level should make the same salary.</p>\n<p>When we base salary on gender or demographic, we limit the amount of greatness that employee can achieve.</p>\n<p>I’m not advocating that all employees in the same role should receive the same salary. Instead, employees performing at the same level for each role should be compensated equally.</p>\n<h3>5. Engage The Community</h3>\n<p>In order to eliminate unconscious bias, and employ a diverse workforce, we must start at the root of the issue; we must promote engineering as a viable career path for all beginning at a young age.</p>\n<p>Several conferences are making strides towards promoting engineering to the younger generations.</p>\n<p>The <a href=\"https://girlswhocode.com/\">Girls Who Code</a> organization is pivotal to the younger generation of girls who are considering engineering as a career path. Their goal is to close the gender gap in technology, and have served over <a href=\"https://girlswhocode.com/about-us/?nabe=6169758503534592:3\">9,000 girls</a> to-date.</p>\n<p>By engaging the community, we plant the seed of programming as a legitimate and achievable career path to all children.</p>\n<h2>Conclusion</h2>\n<p>We can change the stigma surrounding the tech industry with a little work and dedication. By recognizing our implicit biases we can combat a lack of diversification and improve the gap for women and under-represented minorities in science and technology.</p>","tableOfContents":null,"frontmatter":{"path":"/how-to-combat-bias-in-the-tech-industry","title":"How To Combat Bias In The Tech Industry","author":"Emma Wedekind","date":"2018-10-16"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}